tutorials/dieselFoam/aachenBomb/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application    dieselFoam;

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             0.01;

deltaT              2.5e-06;

writeControl        adjustableRunTime;

writeInterval       5.0e-5;

purgeWrite          0;

writeFormat         binary;

writePrecision      6;

writeCompression    uncompressed;

timeFormat          general;

timePrecision       6;

adjustTimeStep      yes;

maxCo               0.1;

runTimeModifiable   yes;

// ************************************************************************* //
