tutorials/dieselFoam/aachenBomb/constant/sprayProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sprayProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationSchemes
{
    U               cellPointFace;
    rho             cell;
    p               cell;
    T               cell;
}

subCycles       2;

atomizationModel        off;
//atomizationModel      LISA;

includeOscillation      yes;
//breakupModel    TAB;
//breakupModel    ETAB;
//breakupModel    ReitzDiwakar;
breakupModel    ReitzKHRT;

//injectorModel         constInjector;
//injectorModel         ChomiakInjector;
//injectorModel         definedInjector;
//injectorModel         pressureSwirlInjector;
injectorModel           hollowConeInjector;

collisionModel  off;

evaporationModel standardEvaporationModel;

heatTransferModel RanzMarshall;

dispersionModel off;

dragModel       standardDragModel;

wallModel       reflect;

specConstAtomizationCoeffs
{
    dropletNozzleDiameterRatio
    (
        0.4
    );
    sprayAngle
    (
        10
    );
}

TABCoeffs
{
    y0              0.0;
    yDot0           0.0;
    Cmu             10.0;
    Comega          8.0;
    WeCrit          12;
}

ETABCoeffs
{
    Cmu         10.0;
    Comega      8.0;
    WeCrit      12;
    k1          0.2;
    k2          0.2;
    WeTransition    100.0;
}

ReitzDiwakarCoeffs
{
    Cbag            6;
    Cb              0.785;
    Cstrip          0.5;
    Cs              10;
}

ReitzKHRTCoeffs
{
    B0              0.61;
    B1              40;
    Ctau            1;
    CRT             0.1;
    msLimit         0.2;
    WeberLimit      6;
}

trajectoryCoeffs
{
    cSpace          1;
    cTime           0.3;
}

standardDragModelCoeffs
{
    preReFactor     0.166667;
    ReExponent      0.666667;
    ReLimiter       1000;
    CdLimiter       0.44;
    Cdistort        2.632;
}

standardEvaporationModelCoeffs
{
    evaporationScheme explicit;
    preReScFactor   0.6;
    ReExponent      0.5;
    ScExponent      0.333333;
}

RanzMarshallCoeffs
{
    preRePrFactor   0.6;
    ReExponent      0.5;
    PrExponent      0.333333;
}

hollowConeInjectorCoeffs
{
    dropletPDF
    {
        //pdfType           exponential;
        pdfType         RosinRammler;

        RosinRammlerPDF
        {
            minValue        1.00e-6;
            maxValue        1.50e-4;

            d
            (
                1.5e-4
            );

            n
            (
                3
            );
        }
        exponentialPDF
        {
            minValue        1.0e-4;
            maxValue        1.0e-3;

            lambda
            (
                1.0e+4
            );
        }
    }

    innerConeAngle
    (
        0.0
    );

    outerConeAngle
    (
        20.0
    );
}

reflectCoeffs
{
    elasticity      0.9;
}

// ************************************************************************* //
