tutorials/dieselFoam/aachenBomb/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermodynamicProperties;
}
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

thermoType hMixtureThermo<reactingMixture>;

CHEMKINFile         "$FOAM_CASE/chemkin/chem.inp";
// We use the central thermo data:
CHEMKINThermoFile   "~OpenFOAM/thermoData/therm.dat";

inertSpecie     N2;

liquidComponents
(
    C7H16
);

liquidProperties
{
    C7H16  C7H16 defaultCoeffs;
}

/*********************************************************************/
